Revit 2027 API
ConnectorElement.Width Property
The width of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual double Width { get; }
Public Overridable ReadOnly Property Width As Double
	Get
public:
virtual property double Width {
	double get ();
}
abstract Width : float with get
override Width : float with get
Property Value
Double
Implements
IConnector.Width
Remarks
-1 if the connector is round.
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace